import re

# 判断用户输入的内容是否为数字, 如果是数字转换为数字类型
# num = input("请输入一段数字:")

# if re.fullmatch(r'\d+(\.\d+)?', num):
#     print('是数字')
#     print(float(num))
# else:
#     print('不是数字')

print('*'*100)

# 用户名匹配
# 以非数字开头, 后面又字母数字_-组成的长度4到14位的字符串
# ^\D[a-z0-9A-Z_\-]{3-13}
print(re.match(r'^\D[a-z0-9A-Z_\-]{3-13}', 'j3p'))

# 邮箱匹配
# ^([a-z0-9_\.-]+)@([\da-z\.-]+)\.([a-z\.]{2,6})$

# 手机号匹配
# r'1[3-9]\d{9}'

# 身份证号匹配
# ^[1-9]\d{5}(18|19|20)\d{2}(0[1-9]|1[0-2])(0[1-9]|[12]\d|3[01])\d{3}[\dXx]$

# 匹配车牌号
# ^[京津沪渝冀豫云辽黑湘皖鲁新苏浙赣鄂桂甘晋蒙陕吉闽贵粤青藏川宁琼][A-HJ-NP-Z][A-HJ-NP-Z0-9]{5}$|^[WJ][A-HJ-NP-Z0-9]{5}[0-9]$|^[使][A-HJ-NP-Z0-9]{6}$

